Repository: AlexanderBuzz/ledger-direct-woocommerce
Catalog: languages/ledger-direct-*.po
Languages: de_de

source: LedgerDirect for WooCommerce
de_de: LedgerDirect für WooCommerce

source: A XRP Ledger integration.
de_de: XRP Ledger Integration.

source: Choose the XRPL Network
de_de: XRPL Netzwerk wählen

source: Payment method updated successfully
de_de: Zahlungsmethode erfolgreich aktualisiert

source: Order not found
de_de: Bestellung nicht gefunden

source: The requested order could not be found.
de_de: Die angegebene Bestellung konnte nicht gefunden werden.

source: Return to homepage
de_de: Zurück zur Startseite

source: Payment not required
de_de: Bezahlung nicht erforderlich

source: Order #%d is already %s.
de_de: Die Bestellung #%d ist bereits %s.

source: View Order
de_de: Bestelldetails ansehen

source: Invalid payment method
de_de: Ungültige Zahlungsmethode

source: This order was not paid with LedgerDirect.
de_de: Diese Bestellung wurde nicht mit LedgerDirect bezahlt.

source: Please send <strong>%s</strong> XRP to the following address:
de_de: Bitte zahlen Sie %s XRP an folgende Adresse :

source: Please send <strong>%s</strong> <strong>%s</strong> to the following address:
de_de: Bitte zahlen Sie %s %s an folgende Adresse :

source: It is important to include the given destination tag when sending funds from your wallet.
de_de: Der Destination Tag muss für eine korrekte Zuordnung der Zahlung mit angegeben werden.

source: Check payment processing
de_de: Zahlungseingang prüfen

source: Order ID
de_de: Bestellnummer

source: Total
de_de: Preis

source: Exchange rate
de_de: Wechselkurs

source: Back
de_de: Zurück

source: Choose payment method
de_de: Zahlungsmethode wählen
